% z=axy^2(M=Cv^2θ)近似の係数を最小二乗法で求める

    %1deg     3deg     5deg    7deg    9deg    11deg   13deg   15deg
z = [0.002365 0.006631 0.01063 0.01529 0.01976 0.02473 0.02911 0.03347  % 対気速度20m/s
     0.009306 0.02707  0.04391 0.06237 0.07661 0.09967 0.1152  0.1357   % 対気速度40m/s
     0.02152  0.05943  0.09837 0.1351  0.18242 0.2214  0.2626  0.3089   % 対気速度60m/s
     0.03536  0.1017   0.1804  0.2552  0.3221  0.3941  0.4611  0.5332]; % 対気速度80m/s
 
x = [1 3 5 7 9 11 13 15] / 180 * pi;    % 動翼角度 [rad]
y = [20 40 60 80];                      % 対気速度 [m/s]
xN = 8; % 動翼角度は8段階
yN = 4; % 対気速度は4段階

Sigma_xxyyyy = 0;
Sigma_zxyy = 0;

for j = 1:xN
    for k = 1:yN
        Sigma_xxyyyy = Sigma_xxyyyy + x(j) ^ 2 * y(k) ^ 4;
        Sigma_zxyy = Sigma_zxyy + z(k,j) * x(j) * y(k) ^ 2; 
    end
end
a = Sigma_zxyy/Sigma_xxyyyy % 係数を計算
